MCUdude/MiniCore/avr/boards.txt
328.menu.clock.20MHz_external=20 MHz external
328.menu.clock.20MHz_external.upload.speed=115200
328.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
328.menu.clock.20MHz_external.build.f_cpu=20000000L

328.menu.clock.18_432MHz_external=18.432 MHz external
328.menu.clock.18_432MHz_external.upload.speed=115200
328.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
328.menu.clock.18_432MHz_external.build.f_cpu=18432000L

328.menu.clock.12MHz_external=12 MHz external
328.menu.clock.12MHz_external.upload.speed=57600
328.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
328.menu.clock.12MHz_external.build.f_cpu=12000000L

328.menu.clock.8MHz_external=8 MHz external
328.menu.clock.8MHz_external.upload.speed=38400
328.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
328.menu.clock.8MHz_external.build.f_cpu=8000000L

328.menu.clock.8MHz_internal=8 MHz internal
328.menu.clock.8MHz_internal.upload.speed=38400
328.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
328.menu.clock.8MHz_internal.build.f_cpu=8000000L

328.menu.clock.1MHz_internal=1 MHz internal
328.menu.clock.1MHz_internal.upload.speed=9600
328.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
328.menu.clock.1MHz_internal.build.f_cpu=1000000L


#############################
#### ATmega168/A/P/PA/PB ####
#############################

# General
168.name=ATmega168
168.upload.tool=avrdude
168.upload.maximum_size=15872
168.upload.maximum_data_size=1024
168.bootloader.tool=avrdude
168.bootloader.unlock_bits=0x3f
168.bootloader.lock_bits=0x0f
168.build.core=MCUdude_corefiles
168.build.board=AVR_ATmega168

# Upload port select
168.menu.bootloader.uart0=Yes (UART0)
168.menu.bootloader.uart0.upload.maximum_size=15872
168.menu.bootloader.uart0.upload.protocol=arduino
168.menu.bootloader.uart0.upload.port=UART0
168.menu.bootloader.uart0.bootloader.extended_fuses=0xfc
168.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

168.menu.bootloader.no_bootloader=No bootloader
168.menu.bootloader.no_bootloader.upload.maximum_size=16384
168.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xfd
168.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# Variants
168.menu.variant.modelP=168P / 168PA
168.menu.variant.modelP.bootloader.cksel_bits=0111
168.menu.variant.modelP.build.variant=standard
168.menu.variant.modelP.build.mcu=atmega168p

168.menu.variant.modelNonP=168 / 168A
168.menu.variant.modelNonP.bootloader.cksel_bits=0111
168.menu.variant.modelNonP.build.variant=standard
168.menu.variant.modelNonP.build.mcu=atmega168

168.menu.variant.modelPB=168PB
168.menu.variant.modelPB.bootloader.cksel_bits=1111
168.menu.variant.modelPB.build.variant=pb-variant
168.menu.variant.modelPB.build.mcu=atmega168pb

# Brown out detection
168.menu.BOD.2v7=BOD 2.7V
168.menu.BOD.2v7.bootloader.high_fuses=0xd5
168.menu.BOD.4v3=BOD 4.3V
168.menu.BOD.4v3.bootloader.high_fuses=0xd4
168.menu.BOD.1v8=BOD 1.8V
168.menu.BOD.1v8.bootloader.high_fuses=0xd6
168.menu.BOD.disabled=BOD disabled
168.menu.BOD.disabled.bootloader.high_fuses=0xd7

# Compiler link time optimization
168.menu.LTO.Os=LTO Disabled
168.menu.LTO.Os.compiler.c.extra_flags=
168.menu.LTO.Os.compiler.c.elf.extra_flags=
168.menu.LTO.Os.compiler.cpp.extra_flags=
168.menu.LTO.Os.ltoarcmd=avr-ar

168.menu.LTO.Os_flto=LTO Enabled
168.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
168.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
168.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
168.menu.clock.16MHz_external=16 MHz external
168.menu.clock.16MHz_external.upload.speed=115200
168.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.16MHz_external.build.f_cpu=16000000L

168.menu.clock.20MHz_external=20 MHz external
168.menu.clock.20MHz_external.upload.speed=115200
168.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.20MHz_external.build.f_cpu=20000000L

168.menu.clock.18_432MHz_external=18.432 MHz external
168.menu.clock.18_432MHz_external.upload.speed=115200
168.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.18_432MHz_external.build.f_cpu=18432000L

168.menu.clock.12MHz_external=12 MHz external
168.menu.clock.12MHz_external.upload.speed=57600
168.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.12MHz_external.build.f_cpu=12000000L

168.menu.clock.8MHz_external=8 MHz external
168.menu.clock.8MHz_external.upload.speed=38400
168.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
168.menu.clock.8MHz_external.build.f_cpu=8000000L

168.menu.clock.8MHz_internal=8 MHz internal
168.menu.clock.8MHz_internal.upload.speed=38400
168.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
168.menu.clock.8MHz_internal.build.f_cpu=8000000L

168.menu.clock.1MHz_internal=1 MHz internal
168.menu.clock.1MHz_internal.upload.speed=9600
168.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
168.menu.clock.1MHz_internal.build.f_cpu=1000000L


############################
#### ATmega88/A/P/PA/PB ####
############################

# General
88.name=ATmega88
88.upload.tool=avrdude
88.upload.maximum_data_size=1024
88.bootloader.tool=avrdude
88.bootloader.unlock_bits=0x3f
88.bootloader.lock_bits=0x0f
88.build.core=MCUdude_corefiles
88.build.board=AVR_ATmega88

# Upload port select
88.menu.bootloader.uart0=Yes (UART0)
88.menu.bootloader.uart0.upload.maximum_size=7680
88.menu.bootloader.uart0.upload.protocol=arduino
88.menu.bootloader.uart0.upload.port=UART0
88.menu.bootloader.uart0.bootloader.extended_fuses=0xfc
88.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex

